--[连续升级]1
--[管理工具版本号]10.35.0
--本脚本支持从ZLHIS+ v10.35.0 升级到 v10.35.10
--请以系统所有者登录PLSQL并执行下列脚本
--脚本执行后，请手工升级导出报表
Define n_System=100;
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
--94404:张德婷,2016-03-28,添加外键修正静配性能问题
declare
i number(1);
begin
  select count(constraint_name) into i from user_constraints where constraint_name=upper('输液配药内容_FK_收发id');
  if i=0 then
    delete /*+ parallel(a) */  from 输液配药内容 A where 收发id not in(select id  from 药品收发记录);
  end if;
exception
  When Others Then
    zl_ErrorCenter(SQLCode, SQLErrM);
end;
/

--94404:张德婷,2016-03-24,添加外键修正静配性能问题
Alter Table 输液配药内容 Add Constraint 输液配药内容_FK_收发id Foreign Key (收发id) References 药品收发记录(ID) On Delete Cascade Enable Novalidate;

--91776:蔡青松,2016-01-21,新增字段 标本发送批号
alter table 病人医嘱发送 add 标本发送批号 number(18);
Create Index 病人医嘱发送_IX_标本发送批号 On 病人医嘱发送(标本发送批号) Pctfree 5 Tablespace zl9Indexcis;

-------------------------------------------------------------------------------
--过程修正部份
------------------------------------------------------------------------------- 


-------------------------------------------------------------------------------------------------------
--更改系统及部件的版本号
-------------------------------------------------------------------------------------------------------
--系统版本号
--可选脚本不用更新
--部件版本号
Commit;