
--本脚本支持从ZLHIS+ v10.35.50 升级到 v10.35.60
--请以系统所有者登录PLSQL并执行下列脚本
--脚本执行后，请手工升级导出报表
Define n_System=100;
-------------------------------------------------------------------------------
--结构修正部份
-------------------------------------------------------------------------------




-------------------------------------------------------------------------------
--数据修正部份
-------------------------------------------------------------------------------
--92837:李业庆,2019-05-15,出库单据库房信息中入库时间处理
--适用范围：10.35.60
--修正内容:根据最早的入库记录生成入库时间，在选择器中查询中用到
--修正范围：修正药品入库信息，考虑性能问题，只查询近1年的数据
--耗时说明: 药品收发记录共950W条，耗时30多秒执行完成，测试环境如下:
--1.硬件环境：PC机
Create Or Replace Procedure Zl1_Optional_药品入库信息_产生 Is
  n_Count Number;
Begin
  Begin
    Select 1 Into n_Count From 药品入库信息 Where Rownum < 2;
  Exception
    When Others Then
      n_Count := 0;
  End;

  If n_Count = 0 Then
    Insert Into 药品入库信息
      (药品id, 库房id, 批次, 入库日期)
      Select b.药品id, b.库房id, b.批次, Min(审核日期)
      From 药品收发记录 A, 药品库存 B, 药品规格 C
      Where a.药品id = b.药品id And a.库房id = b.库房id And Nvl(a.批次, 0) = Nvl(b.批次, 0) And a.入出系数 = 1 And
            a.审核日期 > Sysdate - 365 And b.药品id = c.药品id And b.性质 = 1
      Group By b.药品id, b.库房id, b.批次;
  End If;
Exception
  When Others Then
    zl_ErrorCenter(SQLCode, SQLErrM);
End Zl1_Optional_药品入库信息_产生;
/



-------------------------------------------------------------------------------
--权限修正部份
-------------------------------------------------------------------------------





-------------------------------------------------------------------------------
--报表修正部份
-------------------------------------------------------------------------------






-------------------------------------------------------------------------------
--过程修正部份
-------------------------------------------------------------------------------
--111426:黄捷,2017-07-11,修改检查号后不删除备份
--103994:黄捷,2017-06-30,检查号改成字符型
--基于检查号改成字符型的后续处理。该过程用于删除影像检查记录中废弃字段检查号_bak，最大号码_bak
Create Or Replace Procedure Zl1_Optional_影像检查号bakDel Is
Begin
  If Zl_Checkobject(2, '检查号_bak','影像检查记录') > 0 Then
    Execute Immediate 'ALTER TABLE 影像检查记录 DROP COLUMN 检查号_bak';
  End If;

  If Zl_Checkobject(2, '最大号码_bak','影像检查类别') > 0 Then
    Execute Immediate 'ALTER TABLE 影像检查类别 DROP COLUMN 最大号码_bak';
  End If;

  If Zl_Checkobject(2, '检查号_bak','影像临时记录') > 0 Then
    Execute Immediate 'ALTER TABLE 影像临时记录 DROP COLUMN 检查号_bak';
  End If;
End Zl1_Optional_影像检查号bakDel;
/




---------------------------------------------------------------------------------------------------
--更改系统及部件的版本号
-------------------------------------------------------------------------------------------------------
--系统版本号
--部件版本号
Commit;