--[连续升级]1
--[管理工具版本号]10.35.20
--本脚本支持从ZLHIS+ v10.35.10 升级到 v10.35.20
--请以系统所有者登录PLSQL并执行下列脚本
--脚本执行后，请手工升级导出报表
Define n_System=100;
-------------------------------------------------------------------------------
--结构修正部份
-------------------------------------------------------------------------------
--96519:马政,2016-05-27,可用数量处理
Create table 未审药品记录
(单据 number(2),
no varchar2(8),
库房id number(18),
填制日期 date) 
TABLESPACE zl9MedLst
    initrans 20;

Alter Table 未审药品记录 Add Constraint 未审药品记录_UQ_No Unique (No,单据,库房ID) Using Index Tablespace zl9Indexhis;

Alter Table 未审药品记录 Modify NO Constraint 未审药品记录_NN_NO Not Null;

--96519:马政,2016-05-27,可用数量处理
Alter Table 未审药品记录 Add Constraint 未审药品记录_FK_库房id Foreign Key (库房id) References 部门表(ID) On Delete Cascade;

-------------------------------------------------------------------------------
--数据修正部份
-------------------------------------------------------------------------------
--96519:马政,2016-05-27,可用数量处理
Declare
  --1、出库业务正常未审核单据 记录性质=1 and 审核日期 is null的数据
  --2、入库业务冲销未审核单据 mod(记录性质,3)=2 and 审核日期 is null的数据，验证用时22s
  --3、特殊业务 单据=1的入库退货业务
  Cursor c_未审核单据 Is
    Select Distinct NO, 单据, 库房id, 填制日期
    From (Select Distinct NO, 单据, 库房id, 填制日期
           From 药品收发记录
           Where 记录状态 = 1 And 入出系数 = -1 And 审核日期 Is Null And 单据 In (2, 3, 6, 7, 11, 12) And
                 填制日期 > Trunc(Sysdate) - 90
           Union All
           Select Distinct NO, 单据, 库房id, 填制日期
           From 药品收发记录
           Where Mod(记录状态, 3) = 2 And 入出系数 = 1 And 审核日期 Is Null And 单据 =6 And
                 填制日期 > Trunc(Sysdate) - 90
           Union All
           Select Distinct NO, 单据, 库房id, 填制日期
           From 药品收发记录
           Where 记录状态 = 1 And 入出系数 = 1 And Nvl(发药方式, 0) = 1 And 审核日期 Is Null And 单据 = 1 And 填制日期 > Trunc(Sysdate) - 90)
    Order By 单据;
  n_库房id 药品收发记录.药品id%Type;
Begin
  For r_未审核单据 In c_未审核单据 Loop
    Begin
      Select 库房id
      Into n_库房id
      From 未审药品记录
      Where 单据 = r_未审核单据.单据 And NO = r_未审核单据.No And 库房id = r_未审核单据.库房id And Rownum < 2;
    Exception
      When Others Then
        n_库房id := 0;
    End;
    If n_库房id = 0 Then
      Insert Into 未审药品记录
        (单据, NO, 库房id, 填制日期)
      Values
        (r_未审核单据.单据, r_未审核单据.No, r_未审核单据.库房id, r_未审核单据.填制日期);
    End If;
  End Loop;
End;
/


-------------------------------------------------------------------------------
--权限修正部份
-------------------------------------------------------------------------------



-------------------------------------------------------------------------------
--报表修正部份
-------------------------------------------------------------------------------




-------------------------------------------------------------------------------
--过程修正部份
-------------------------------------------------------------------------------



---------------------------------------------------------------------------------------------------
--更改系统及部件的版本号
-------------------------------------------------------------------------------------------------------
--系统版本号

--部件版本号
Commit;