--[连续升级]1
--[管理工具版本号]10.35.90
--本脚本支持从ZLHIS+ v10.35.80 升级到 v10.35.90
--请以系统所有者登录PLSQL并执行下列脚本
--脚本执行后，请手工升级导出报表
Define n_System=100;
-------------------------------------------------------------------------------
--结构修正部份
-------------------------------------------------------------------------------



-------------------------------------------------------------------------------
--数据修正部份
-------------------------------------------------------------------------------
--000000:蒋敏,2017-12-07,删除创建表时在主键上创建not null的约束
Declare
  v_sql Varchar2(1000);
Begin
  For R In (Select Distinct a.Table_Name, a.Constraint_Name
            From User_Cons_Columns A, User_Constraints B, Zltables C
            Where a.Constraint_Name = b.Constraint_Name And a.Owner = b.Owner And b.Constraint_Type = 'C' And a.Table_Name = c.表名 And
                  Exists (Select 1
                   From User_Cons_Columns A1, User_Constraints B1
                   Where A1.Constraint_Name = B1.Constraint_Name And A1.Owner = B1.Owner And B1.Constraint_Type = 'P' And
                         A1.Column_Name = a.Column_Name And A1.Table_Name = a.Table_Name And A1.Owner = a.Owner)
            ) Loop    
      v_sql := 'Alter Table ' || R.Table_Name || ' Drop Constraint ' || R.Constraint_Name;
      Execute Immediate v_sql;
  End Loop;
End;
/


-------------------------------------------------------------------------------
--权限修正部份
-------------------------------------------------------------------------------



-------------------------------------------------------------------------------
--报表修正部份
-------------------------------------------------------------------------------




-------------------------------------------------------------------------------
--过程修正部份
-------------------------------------------------------------------------------



---------------------------------------------------------------------------------------------------
--更改系统及部件的版本号
-------------------------------------------------------------------------------------------------------
--系统版本号

--部件版本号
Commit;