Attribute VB_Name = "mdlPlugIn"
Option Explicit

Public gcnOracle As ADODB.Connection

Public Enum Enum_Modue '模块号
    m门诊医嘱模块 = 1252
    m住院医嘱模块 = 1253
    m住院护士站模块 = 1254
    m临床路径模块 = 1256
    m病历模块 = 1070
    m人员管理模块 = 1002
    m医嘱附费模块 = 1257
    
    m门诊医生工作站 = 1260
    m住院医生工作站 = 1261
    m住院护士工作站 = 1262
    m医技工作站 = 1263
    m新版护士站 = 1256
    
    '血库相关模块
    m科室配血管理 = 1935
    '科室配血管理页签没有模块号，增加序号表示对应页签
    m科室配血管理_常规复查 = 193501
    m科室配血管理_配血记录 = 193502
    m血液目录管理 = 1900
    m血液输血反应 = 1938
    m科室发血管理 = 1936
    m血液供应入库 = 1915
    m血液报废出库 = 1922
    
    m体检中心管理 = 2121
    m体检总检登记 = 2125
    m体检分科执行 = 2122
    m体检结果登记 = 2123
End Enum
