----------------------------------------------------------------------------------------------------------------
--本脚本支持从ZLHIS+ v10.35.90升级到 v10.35.90
--请以数据空间的所有者登录PLSQL并执行下列脚本
Define n_System=100;
----------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------
--结构修正部份
------------------------------------------------------------------------------



------------------------------------------------------------------------------
--数据修正部份
------------------------------------------------------------------------------


-------------------------------------------------------------------------------
--权限修正部份
-------------------------------------------------------------------------------



-------------------------------------------------------------------------------
--报表修正部份
-------------------------------------------------------------------------------



-------------------------------------------------------------------------------
--过程修正部份
-------------------------------------------------------------------------------
--144226:李南春,2019-09-03,如果交易状态为1则退出交易
Create Or Replace Function Zl_Fun_三方交易记录_Locked
(
  类别_In     三方交易记录.类别%Type,
  流水号_In   三方交易记录.流水号%Type,
  卡号_In     三方交易记录.卡号%Type := Null,
  交易说明_In 三方交易记录.交易说明%Type := Null,
  业务类型_In 三方交易记录.业务类型%Type := Null
) Return Number Is

  --------------------------------------------------------------------------
  -- 功能:三方交易锁
  -- 类别_IN:医疗卡类别名称(比如：建行卡，招行卡，消费卡等）
  -- 流水号_In: 流水号不能传入空，传入空时，将不进行数据锁
  --返回:0-表示锁失败或者交易正被另一个事务执行or已经执行成功,1-表示锁成功
  --------------------------------------------------------------------------
  Err_Item Exception;
  v_Err_Msg Varchar2(255);
  n_Count   Number(18);
  n_Number  Integer;

  Procedure Zl_三方交易记录_Insert
  (
    类别_In     三方交易记录.类别%Type,
    流水号_In   三方交易记录.流水号%Type,
    卡号_In     三方交易记录.卡号%Type := Null,
    交易说明_In 三方交易记录.交易说明%Type := Null,
    业务类型_In 三方交易记录.业务类型%Type := Null,
    状态_Out    Out Integer
  ) Is
    Pragma Autonomous_Transaction;
    ------------------------------------------------
    --功能:插入数据
    --返回:状态_Out:1-插入成功,2-插入失败(其他用户已经在使用)
    ------------------------------------------------
    n_Return Integer;
  Begin
    n_Return := 1;
    Begin
      Insert Into 三方交易记录
        (类别, 流水号, 状态, 卡号, 交易说明, 交易时间, 业务类型)
      Values
        (类别_In, 流水号_In, 0, 卡号_In, 交易说明_In, Sysdate, 业务类型_In);
    Exception
      When Others Then
        n_Return := 2;
    End;
    状态_Out := n_Return;
    Commit;
  Exception
    When Others Then
      状态_Out := 0;
  End Zl_三方交易记录_Insert;
Begin
  If 流水号_In Is Null Then
    Return 1;
  End If;
  Select Count(1) Into n_Count From 三方交易记录 Where 类别 = 类别_In And 流水号 = 流水号_In;
  If Nvl(n_Count, 0) = 0 Then
    --插入数据
    Zl_三方交易记录_Insert(类别_In, 流水号_In, 卡号_In, 交易说明_In, 业务类型_In, n_Number);
    If n_Number = 2 Then
      n_Count := 0;
      Return n_Count;
    End If;
  End If;
  Begin
    Select 状态 Into n_Count From 三方交易记录 Where 类别 = 类别_In And 流水号 = 流水号_In For Update Nowait;
    Update 三方交易记录 Set 状态 = 1 Where 类别 = 类别_In And 流水号 = 流水号_In And 状态 = 0;
    If sql%Notfound Then
      n_Count := 0;
    Else
      n_Count := 1;
    End If;
  Exception
    When Others Then
      n_Count := 0;
  End;
  Return n_Count;
Exception
  When Others Then
    zl_ErrorCenter(SQLCode, SQLErrM);
End Zl_Fun_三方交易记录_Locked;
/





------------------------------------------------------------------------------------
--系统版本号
Update zlSystems Set 版本号='10.35.90.0073' Where 编号=&n_System;
Commit;
