----------------------------------------------------------------------------------------------------------------
--本脚本支持从ZLHIS+ v10.35.90升级到 v10.35.90
--请以数据空间的所有者登录PLSQL并执行下列脚本
Define n_System=100;
----------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------



------------------------------------------------------------------------------
--结构修正部份
------------------------------------------------------------------------------



------------------------------------------------------------------------------
--数据修正部份
------------------------------------------------------------------------------
--120476:胡俊勇,2018-08-17,新增参数修改
Insert Into zlParameters(ID,系统,模块,私有,本机,授权,固定,部门,性质,参数号,参数名,参数值,缺省值,影响控制说明,参数值含义,关联说明,适用说明,警告说明)
Select zlParameters_ID.Nextval,&n_System,1252,A.* From (
Select 私有,本机,授权,固定,部门,性质,参数号,参数名,参数值,缺省值,影响控制说明,参数值含义,关联说明,适用说明,警告说明 From zlParameters Where 1 = 0 Union All 
    Select 0,0,0,0,1,0,67,'门诊可用发料部门',NULL,NULL,'结合参数"指定药房时限定库存"进行以下控制：'||CHR(13)||'1.输入跟踪在用卫材后显示的查找列表中，是否显示本参数指定范围内没有库存的卫材；'||CHR(13)||'2.输入卫材医嘱后，缺省的执行科室只显示本参数指定范围内的科室；'||CHR(13)||'5.医嘱编辑卡片界面的发料部门下拉列表，只显示本参数指定范围内的科室',NULL,'结合系统参数"指定药房时限定库存"进行控制，在本参数指定的科室没有库存的卫材，不显示出来。','适用于可用发料部门设置多个',NULL From Dual Union All 
Select 私有,本机,授权,固定,部门,性质,参数号,参数名,参数值,缺省值,影响控制说明,参数值含义,关联说明,适用说明,警告说明 From zlParameters Where 1 = 0) A;

Insert Into zlParameters(ID,系统,模块,私有,本机,授权,固定,部门,性质,参数号,参数名,参数值,缺省值,影响控制说明,参数值含义,关联说明,适用说明,警告说明)
Select zlParameters_ID.Nextval,&n_System,1253,A.* From (
Select 私有,本机,授权,固定,部门,性质,参数号,参数名,参数值,缺省值,影响控制说明,参数值含义,关联说明,适用说明,警告说明 From zlParameters Where 1 = 0 Union All 
    Select 0,0,0,0,1,0,69,'住院可用发料部门',NULL,NULL,'结合参数"指定药房时限定库存"进行以下控制：'||CHR(13)||'1.输入跟踪在用卫材后显示的查找列表中，是否显示本参数指定范围内没有库存的卫材；'||CHR(13)||'2.输入卫材医嘱后，缺省的执行科室只显示本参数指定范围内的科室；'||CHR(13)||'5.医嘱编辑卡片界面的发料部门下拉列表，只显示本参数指定范围内的科室',NULL,'结合系统参数"指定药房时限定库存"进行控制，在本参数指定的科室没有库存的卫材，不显示出来。','适用于可用发料部门设置多个',NULL From Dual Union All 
Select 私有,本机,授权,固定,部门,性质,参数号,参数名,参数值,缺省值,影响控制说明,参数值含义,关联说明,适用说明,警告说明 From zlParameters Where 1 = 0) A;

Update zlParameters
set 关联说明='本参数会影响（科室药房对照）的参数性质，即以下这批参数：'||chr(13)|| '模块1252－门诊缺省西药房,门诊缺省成药房,门诊缺省中药房,门诊缺省发料部门,门诊可用西药房,门诊可用成药房,门诊可用中药房,门诊可用发料部门;'||chr(13)|| '模块1253－住院缺省西药房,住院缺省成药房,住院缺省中药房,住院缺省发料部门,住院可用西药房,住院可用成药房,住院可用中药房,住院可用发料部门.'||chr(13)|| '本参数对（科室药房对照）参数影响，要重新登陆导航台后才生效。'
Where 参数名='科室药房对照按本机参数设置' and nvl(模块,0)=0 and 系统=&n_System;


-------------------------------------------------------------------------------
--权限修正部份
-------------------------------------------------------------------------------



-------------------------------------------------------------------------------
--报表修正部份
-------------------------------------------------------------------------------



-------------------------------------------------------------------------------
--过程修正部份
-------------------------------------------------------------------------------




------------------------------------------------------------------------------------
--系统版本号
Update zlSystems Set 版本号='10.35.90.0025' Where 编号=&n_System;
Commit;
